app/views/comments/_index.html.haml

    // User Photo
    - if comment.user.photo.present?
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]