app/views/users/show.html.haml

            ここでの「ふつう」
            = "(#{@user.posts.count})"
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]