app/views/posts/_new.html.haml

SELECT "posts".* FROM "posts"
---
        = f.input :photo, label: false do
          -if post.photo.present?
            .image-upload-box.post-image-box