app/views/posts/_show.html.haml

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 6]]
---
        %a.collapsable.post-collapse{ data: { target: "#comment-box#{post.id}" } }
          = "Comment #{Comment.count_all(post.comments)}"