app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "post_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["post_id", 6], ["content", "ola, seu merda!"], ["created_at", "2018-08-30 20:00:13.956204"], ["updated_at", "2018-08-30 20:00:13.956204"]]
---
  def create
    @comment = Comment.new(comment_params)
    authorize @comment
    @comment.user = @user
    @comment.post = @post
    if @comment.save