app/controllers/posts_controller.rb

SELECT "reaction_tags".* FROM "reaction_tags"
---
  def index
    if params[:user_id]
      @posts = policy_scope(Post).where(user: User.find(params[:user_id])).order(created_at: 'desc')
    else
      @posts = policy_scope(Post).order(created_at: 'desc')
      @post = Post.new
    end
    @comment = Comment.new
    @reaction = Reaction.new
    @reaction_tags = ReactionTag.all

INSERT INTO "posts" ("content", "category_id", "user_id", "created_at", "updated_at", "title") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @post = Post.new(post_params)
    @post.user = @user
    authorize(@post)
    if @post.save

UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "Bacon!!"], ["updated_at", "2018-08-30 19:22:44.139434"], ["id", 2]]
---
  def update
    authorize(@post)
    if @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 2]]
---
  def destroy
    authorize(@post)
    if @post.destroy