app/controllers/posts_controller.rb

  def index
    if params[:user_id]
      @posts = Post.where(user: User.find(params[:user_id])).order(created_at: 'desc')
    else
      @posts = Post.all.order(created_at: 'desc')
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY "posts"."created_at" DESC  [["user_id", 1]]
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC