app/controllers/reactions_controller.rb

DELETE FROM "reactions" WHERE "reactions"."id" = $1  [["id", 1]]
UPDATE "reactions" SET "reaction_tag_id" = $1, "updated_at" = $2 WHERE "reactions"."id" = $3  [["reaction_tag_id", 2], ["updated_at", "2018-08-27 21:57:40.157933"], ["id", 1]]
INSERT INTO "reactions" ("reaction_target_type", "reaction_target_id", "reaction_tag_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["reaction_target_type", "Post"], ["reaction_target_id", 2], ["reaction_tag_id", 1], ["user_id", 1], ["created_at", "2018-08-27 22:13:29.086774"], ["updated_at", "2018-08-27 22:13:29.086774"]]
---
  def change
    # Find the same reaction
    if @reaction = Reaction.find_by(reaction_target: @reaction_target, user: current_user)
      if @reaction.reaction_tag.id == params[:reaction_tag_id].to_i
        if @reaction.destroy
          redirect_to posts_url
        else
          redirect_to posts_url
        end
      elsif @reaction.update(reaction_params)
        redirect_to posts_url
      else
        redirect_to post_url
      end
    else
      @reaction = Reaction.new(reaction_params)
      @reaction.reaction_target = @reaction_target
      @reaction.user = current_user
      if @reaction.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def set_reaction_target
    @reaction_target = Post.find(params[:post_id]) if params[:post_id]
    @reaction_target = Comment.find(params[:comment_id]) if params[:comment_id]