app/controllers/users_controller.rb

UPDATE "users" SET "nickname" = $1, "photo" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["nickname", "Danilo"], ["photo", "WhatsApp_Image_2018-06-18_at_8.41.36_AM.jpeg"], ["updated_at", "2018-08-23 03:35:22.469415"], ["id", 1]]
---
  def update
    authorize @user
    if @user.update(user_params)